Tekla Open API Reference for Tekla Structures 2025
ReferenceModelAttributes Methods
The ReferenceModel.ReferenceModelAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
ReferenceModel.ReferenceModelAttributes Class
Tekla.Structures.Drawing Namespace